x = c(1 ,3, 5, 2, 4, 6)
x
A = matrix(x,3,2)
A


x = c(2,7,8,9,1,4)
x
B = matrix(x,3,2)
B

x = c(5,2,3,6)
x
C = matrix(x,2,2)
C

A + B
A - B
A * B
A / B
B %*% C



A[3,]
B[,1]

solve(C)
det(C)
solve(C,c(11,14))



Class = data.frame(
  学号=c(1,2,3,4,5),
  姓名=c("关颖利","金纤凡","李静瑶","李帅旭","李晓博"),
  期中成绩=c(80.50,80.50,89.00,79.50,85.50),
  摸底成绩=c(77.00,43.00,61.00,76.00,79.00),
  期末成绩=c(84.00,83.00,92.00,97.00,96.00)
)



B = c(145,155,165,175,185,195,205,215,225,235)
C = c(4,9,16,27,20,17,10,8,4,5)
x = sum(B * C) / sum(C)
x
D = abs(B - x)
D
E = D * C
E
sum(E)/sum(C)






